Linux/LinuxOS/help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>显示所有man文档的编号</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="显示所有man文档的编号"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-02 00:33:18 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#linuxos">主页</a><br/><a href="#disqus_thread">评论</a></div>


</head>
<body>


<div id="content">
<h1 class="title">显示所有man文档的编号</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>


<p>
man -f man 显示man程序的所有文档<br/>
</p>
<p>
在man中查询<br/>
apropos keywords<br/>
man -k keywords<br/>
</p>
<p>
重建man库<br/>
makewhatis<br/>
</p>
<p>
查询man文档位置<br/>
whereis man 查询man的文档位置<br/>
</p>
<p>
查看当前man的文档目录<br/>
manpath<br/>
</p>
<p>
打印man文档<br/>
man -t finger | lpr 打印<br/>
lpstat -p -d 查看打印机状态<br/>
</p>
<p>
用浏览器打开<br/>
man -Hfirefox bash<br/>
</p>
<p>
将man的结果保存在文件内<br/>
man bash | col -b &gt; bash.txt<br/>
col是用来对文本进行转换的命令，这里是去掉所有的退格符号<br/>
</p>
<p>
名称<br/>
man-显示线上求助手册(manualpage)manpath-决定线上手册的搜寻路径<br/>
</p>
<p>
摘要<br/>
man[-acdfhkKtwW][-msystem][-pstring][-Cconfig_file][-Mpath][-Ppager][-Ssection_list][section]name&hellip;<br/>
</p>
<p>
描述<br/>
man是用来排版并显示线上求助手册,此版本了解MANPATH与(MAN)PAGER这两个环境变数,所以你可以拥有个人的线上手册,并选择任何程式来显示已排版的手册。如果指定了section,则man只会显示该手册的特定章节。您也可以利用选项或是环境变数来指定搜寻的次序或是排版之前的处理工具。如果name包含了`/'则man会先搜寻所指定的档案,所以您可以man./foo.5或者是man/cd/foo/bar.1.gz。<br/>
</p>
<p>
选项<br/>
-Cconfig_file指定设定档man.conf;内定值是/etc/man.conf。(Seeman.conf(5).)<br/>
-M<br/>
path指定了线上手册的搜寻路径,如果没有指定则使用环境变数MANPATH的设定;如果没有使用MANPATH,则会使用/usr/lib/man.conf内的设定;如果MANPATH是空字串则表示使用内定值。<br/>
-P<br/>
pager指定使用何种pager.man会优先使用此选项设定,然后是依环境变数MANPAGER设定,然后是环境变数PAGER;man内定使用/usr/bin/less-is。<br/>
-S<br/>
section_listman所搜寻的章节列表(以冒号分隔),此选项会覆盖环境变数MANSECT的设定。<br/>
-a<br/>
man内定在显示第一个找到的手册之后就会停止搜寻,使用此选项会强迫man显示所有符合name的线上手册。<br/>
-c<br/>
即使有最新的catpage,还是对线上手册重新作排版,本选项在萤幕的行列数改变时或已排版的线上手册损坏时特别有意义。<br/>
-d<br/>
不要真的显示线上手册,只显示除错讯息。<br/>
-D<br/>
同时显示线上手册与除错讯息。<br/>
-f<br/>
功能同whatis。<br/>
-h<br/>
显示求助讯息然后结束程式。<br/>
-k<br/>
功能同apropos。<br/>
-K<br/>
对所有的线上手册搜寻所指定的字串。警告:本功能回应速度可能很慢!如果指定section会对速度有帮助。<br/>
-m<br/>
system依所指定的system名称而指定另一组的线上手册。<br/>
-p<br/>
string指定在nroff或troff之前所执行的处理程式不是所有的安装都会有完整的前处理器。各个前处理器所代表的字母分别为:eqn(e),grap(g),pic(p),tbl(t),vgrind(v),refer(r).本选项覆盖环境变数MANROFFSEQ的设定。<br/>
-t<br/>
使用/usr/bin/groff-Tps-mandoc来对线上手册排版,并将结果显示至stdout。/usr/bin/groff-Tps-mandoc的输出结果可能还需要特定的过滤器才能列印(如bg5ps)。<br/>
-w或&ndash;path<br/>
不要真的显示线上手册,但显示线上手册的位置.如果没有指定引数则显示man所搜寻的目录列表。如果manpath是man的□结,则玬anpath?功能同玬an&ndash;path?。<br/>
-W<br/>
功能类-w,但每行只印出一个档名,不印出额外的讯息.这在下面的状况特别有用:man-aWman|xargsls-l。<br/>
</p>

<p>
man会试着存下已排版的线上手册,以节省下回排版所需要的时间。传统上,位于DIR/X的手册在排版完成后会存于DIR/catX,但在这里是存于/var/ctaman/catX。如果系统没有所需要的目录,则不会有任何catpage存档。<br/>
</p>
<p>
Itispossibletomakemansuidtoauserman.Then,ifacatdirectoryhasownermanandmode0755(onlywritablebyman),andthecatfileshaveownermanandmode0644or0444(onlywritablebyman,ornotwritableatall),noordinaryusercanchangethecatpagesorputotherfilesinthecatdirectory.Ifmanisnotmadesuid,thenacatdirectoryshouldhavemode0777ifallusersshouldbeabletoleavecatpagesthere.<br/>
</p>
<p>
选项-c强迫对线上手册重新作排版。<br/>
</p>
<p>
环境变数<br/>
MANPATHMANPATH用来设定man的搜寻路径。<br/>
MANROFFSEQ<br/>
MANROFFSEQ用来设定在nroff或troff执行前所需要的前处理器。内定在nroff前会先执行tablepreprocessor。<br/>
MANSECT<br/>
MANSECT决定man搜寻的章节。<br/>
MANWIDTH<br/>
MANWIDTH用来设定显示的宽度。若无设定,则手册会填满您萤幕的宽度。<br/>
MANPAGER<br/>
MANPAGER决定了显示线上手册的工具。如果无MANPAGER则使用PAGER,如果两者皆未设定则使用/usr/bin/less-is。<br/>
</p>
<p>
LANGLANG决定了man先搜寻的的子目录的名称所以`LANG=dkman1foo'会使man先搜寻[path]/dk/man1/foo.1,如果找不到该档,man才去寻找[path]/man1/foo.1,[path]是指预设的搜寻路径。<br/>
</p>
<p>
NLSPATH,LC_MESSAGES,LANG<br/>
环境变数NLSPATH与LC_MESSAGES(如果LC_MESSAGE不存在则使用LANG)用来指定讯息的语言种类.(英文讯息是编译时即内定,故不需另外设定.)请注意,man所呼叫的程式,如col(1)也会使用这些环境变数。<br/>
</p>
<p>
PATHPATH是用来设定man的搜寻线上手册的路径。<br/>
</p>
<p>
SYSTEMSYSTEM用来设定替代的系统名(此为选项-m所使用)。<br/>
</p>
<p>
相关说明<br/>
apropos(1),whatis(1),less(1),groff(1)。<br/>
</p>
<p>
臭虫<br/>
选项-t只会在有类似troff工具存在时才有功用。在gnome-help-browser还看不到中文。在kdehelp中可看到中文,但固定字型建建议选取courier或lucidatyperiter。（BP1.0）<br/>
<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</p></div>

</body>
</html>
